{
  "name": "Sergio da Silva",
  "image": "/Portfolio/sergioprofile.jpeg",
  "profession": "Web Designer",
  "intro": "I am a Web Designer",
  "about": "My major is Web Design and Development, and my minor is in Graphic Design so I could be even better at designing websites.Drawing is one of my favorite hobbies. Besides the HTML, CSS, and JS essential programming languages of web development, I also know how to write in Python and C++. I am a proactive learner and a good teacher. One example of that is that I learned how to speak English myself, and started a free English class in my community, having almost 10 active students for 6 months before coming to Rexburg.During COVID, I had a home-office internship at FamilySearch. I've created images, blog articles, translated videos, and live streaming for their social media. I also learned about Power BI there. I've created and weekly updated data models about all the FamilySearch Brazil Area reach using Power BI.",
  "website": "https://sergioo29.github.io/Portfolio/",
  "skills": [
    {
      "src": "/Portfolio/logos/typescript.svg",
      "name": "Typescript",
      "link": "https://www.typescriptlang.org/"
    }
  ],
  "projects": [
    {
      "name": "Report Refactoring",
      "image": "/Portfolio/logos/NET.svg",
      "about": "This refactoring ticket saved the client $30,000 a year in man hours, removing a 2 minute search that the Customer Service Agents would do over 45K times a year. There was a specific report in the client website that lacked important information. To solve the problem I researched different internal API's, found the best and added its data to the report. This included authentication with a bearer token and creating the data structures in C# to represent the API response. I also added error handling in several locations so the backend would handle the situation, were the API to be unresponsive.",
      "tech": [ "C#", ".NET", "SQL" ],
      "links": {},
      "role": "Software Engineer"
    },
    {
      "name": "Media Server Android App",
      "image": "/Portfolio/projects/android.svg",
      "about": "This project is an alternative to Google Photos or any other cloud storage solution for photos and videos. It includes a server to be set up in an old laptop and an Android app to upload the photos and videos. The goal is to put to use an old computer you may have and to avoid the surveillance and lack of privacy from companies like Google.",
      "tech": [ "Java", "SFTP", "Android" ],
      "links": {
        "GitHub": "https://github.com/jamesbigenterprise/MediaServer",
        "Live": "https://www.youtube.com/watch?v=bLOL7dnXrFE"
      },
      "role": "Undergrad Student"
    }
  ],
  "testimonials": [
    {
      "value": "Sergio is a great communicator. I mentored him for one year during the BYU Pathway Worldwide program. His lessons were engaging and instructive. He made good use of humor to maintain the class engaged and we had a good time. On top of that, he is a good graphic designer, I say that based on the work I have seen so far.",
      "name": "James Alves",
      "relation": "Mentor",
      "pfp": "/Portfolio/circleprofile.jpeg",
      "link": "https://www.linkedin.com/in/alves-james/"
    }
   
  ],
  "links": [
    {
      "name": "GitHub",
      "icon": "github.svg",
      "link": "https://github.com/Sergioo29"
    },
    {
      "name": "Mail me",
      "icon": "mail.svg",
      "link": "sergiohds_29@hotmail.com"
    },
    {
      "name": "LinkedIn",
      "icon": "linkedin.svg",
      "link": "https://www.linkedin.com/in/sergio-da-silva-5b7060209/"
    }
  ]
}
